# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |



a = input("Введите трёхзначное число: ")
n1 = int(a[0])
n2 = int(a[1])
n3 = int(a[2])

sum = n1 + n2 + n3
print(sum)
